src_doc/Enums/СпособыСогласованияВРежимеЗамечаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыСогласованияВРежимеЗамечаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MicrosoftOfficeWord</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OpenOfficeOrgWriter</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LibreOffice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Р7Builder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/CommonModules/СогласованиеВРежимеЗамечанийСерверПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СпособСогласованияВРежимеЗамечаний() Экспорт
	
	Возврат Константы.СпособСогласованияВРежимеЗамечаний.Получить();
	
КонецФункции	

Функция ЭтоФайлДляСогласованияВРежимеЗамечаний(Расширение) Экспорт
	
	СпособСогласования = СпособСогласованияВРежимеЗамечаний();
	
	Если СпособСогласования = Перечисления.СпособыСогласованияВРежимеЗамечаний.MicrosoftOfficeWord Тогда
	
		Если НРег(Расширение) = НРег("doc") Или НРег(Расширение) = НРег("docx") Или НРег(Расширение) = НРег("odt")
			Или НРег(Расширение) = НРег("xls") Или НРег(Расширение) = НРег("xlsx") Тогда
			Возврат Истина;
		КонецЕсли;
				
	ИначеЕсли СпособСогласования = Перечисления.СпособыСогласованияВРежимеЗамечаний.OpenOfficeOrgWriter Тогда			

		// docx - только для удаления или добавления комментариев, для завершения старых обработок
		// конвертация в html для него не сработает
		Если НРег(Расширение) = НРег("odt") Или НРег(Расширение) = НРег("doc") 
			Или НРег(Расширение) = НРег("docx") Тогда 
			Возврат Истина;
		КонецЕсли;

	ИначеЕсли СпособСогласования = Перечисления.СпособыСогласованияВРежимеЗамечаний.LibreOffice Тогда			

		Если НРег(Расширение) = НРег("odt") 
			Или НРег(Расширение) = НРег("doc") 
			Или НРег(Расширение) = НРег("docx") Тогда 
			Возврат Истина;
		КонецЕсли;
		
	ИначеЕсли СпособСогласования = Перечисления.СпособыСогласованияВРежимеЗамечаний.Р7Builder Тогда			

		Если НРег(Расширение) = НРег("odt") Или НРег(Расширение) = НРег("docx") Тогда 
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;			
	
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
